<html>
	<head>
		<title></title>
	</head>
	<body>
		<h1 style="text-align: center;">
			<a target="ventana">&iquest;C&oacute;mo crear archivo extensi&oacute;n csv</a><a target="ventana">?</a></h1>
		<p>
			Para crear un archvivo con extensi&oacute;n csv exiten dos herramientas muy conocidas, estan son:</p>
		<ul>
			<li>
				<strong>LibreOffice:</strong> Que es una suite ofim&aacute;tica libre y gratuita. Cuenta con un procesador de texto (Writer), un editor de hojas de c&aacute;lculo (Calc), un creador de presentaciones (Impress), un gestor de bases de datos (Base), un editor de gr&aacute;ficos vectoriales (Draw), y un editor de f&oacute;rmulas matem&aacute;ticas (Math).</li>
			<li>
				<strong>Microsoft Office: </strong>Que es una <span class="mw-redirect">suite de oficina</span> <span class="mw-redirect">propietario / Microsoft CLUF,</span> que abarca e interrelaciona aplicaciones de escritorio, servidores. Office algunas de las herramientas que contiene son un procesador de texto Microsoft Word, un editor de hojas de c&aacute;lculo Microsoft Excel y un creador de presentaciones Microsoft PowerPoint.</li>
		</ul>
		<p>
			Contamos con un archivo llamado plantilla.xls, esta plantilla se usar&aacute; para llenar los datos de los libros. Veremos como guardar el archivo con extensi&oacute;n csv delimitado por (;) en las siguientes herramientas:</p>
		<h1>
			LibreOffice Calc<a target="ventana">:</a></h1>
		<p>
			Al exportar una hoja c&aacute;lculo al formato CSV, s&oacute;lo se guardan los datos de la hoja actual. El resto de la informaci&oacute;n, f&oacute;rmulas y formato inclusive, se pierde.</p>
		<ol>
			<li>
				Abra la hoja de Calc que desee guardar como archivo de texto CSV.<br />
				S&oacute;lo se puede exportar la hoja actual.</li>
			<li>
				Active el comando <b>Archivo - Guardar como</b>.</li>
			<li>
				En el cuadro <b>Nombre de archivo</b>, introduzca un nombre para el archivo.</li>
			<li>
				En el campo <b>Tipo de archivo</b>, seleccione &quot;Texto CSV&quot;.</li>
			<li>
				(Opcional) Configure las opciones de campo para el archivo de texto CSV.<br />
				Seleccione <b>Editar configuraci&oacute;n de filtros</b>.<br />
				En el di&aacute;logo <b>Exportaci&oacute;n de texto</b>, seleccione las opciones que prefiera.<br />
				Haga clic en <b>Aceptar</b>.</li>
			<li>
				Haga clic en <b>Guardar</b>.</li>
		</ol>
		<p>
			&nbsp;</p>
		<h1>
			<a target="ventana">Microsoft Excel:</a></h1>
		<p>
			Puede convertir una hoja de c&aacute;lculo de Excel en un archivo de texto con el comando <b class="ui">Guardar como</b>.</p>
		<ol class="cntIndent36" start="1" type="1">
			<li>
				Haga clic en la pesta&ntilde;a <b class="ui">Archivo</b> y, a continuaci&oacute;n, haga clic en <b class="ui">Guardar como</b>.
				<ul type="disc">
					<li>
						Se abrir&aacute; el cuadro de di&aacute;logo <b class="ui">Guardar como</b>.</li>
				</ul>
			</li>
			<li>
				En el cuadro <b class="ui">Guardar como tipo</b>, elija el formato de archivo de texto para la hoja de c&aacute;lculo.
				<ul type="disc">
					<li>
						Por ejemplo, haga clic en <b class="ui">Texto (delimitado por tabulaciones)</b> o <b class="ui">CSV (delimitado por comas)</b>.</li>
				</ul>
			</li>
			<li>
				Busque la ubicaci&oacute;n en la que desee guardar el nuevo archivo de texto y, a continuaci&oacute;n, haga clic en <b class="ui">Guardar</b>.</li>
			<li>
				Aparecer&aacute; un cuadro de di&aacute;logo en el que se informa de que solo la hoja de c&aacute;lculo actual se va a guardar en el nuevo archivo. Si est&aacute; seguro de que la hoja de c&aacute;lculo actual es la que desea guardar como archivo de texto, haga clic en <b class="ui">Aceptar</b>. Puede guardar otras hojas de c&aacute;lculo como archivos de texto distintos repitiendo este procedimiento para cada hoja.</li>
			<li>
				Aparecer&aacute; un segundo cuadro de di&aacute;logo en el que se indica que la hoja de c&aacute;lculo puede contener caracter&iacute;sticas no compatibles con los formatos de archivo de texto. Si solo est&aacute; interesado en guardar los datos de la hoja de c&aacute;lculo en el nuevo archivo de texto, haga clic en <b class="ui">S&iacute;</b>. Si no est&aacute; seguro y desea obtener m&aacute;s informaci&oacute;n sobre las caracter&iacute;sticas de Excel incompatibles con los formatos de archivo de texto, haga clic en <b class="ui">Ayuda</b> para obtener informaci&oacute;n.</li>
		</ol>
		<p>
			Una vez creado el archvio con extensi&oacute;n CSV, puede ser cargado al sistema, vea <a href="loadlote.html">&#191;C&oacute;mo cargar archivo por lote?</a>.</p></body>
</html>
